Repository: ikalnytskyi/wp-highlight.js
Catalog: wp-highlight.js/translations/hljs-*.po
Languages: ru_ru

source: wp-highlight.js settings
ru_ru: Настройки wp-highlight.js

source: Settings
ru_ru: Настройки

source: All configurations successfully saved...
ru_ru: Все настройки успешно сохранены...

source: Color Scheme:
ru_ru: Цветовая схема:

source: You can replaces TAB (\x09) characters used for indentation in your code with some fixed number of spaces or with a &lt;span&gt; to set them special styling:
ru_ru: Вы можете заменить символы TAB(\x09), используемые для отступов в вашем исходном коде, на фиксированное число пробелов или на &lt;span&gt; вставку, для предания отступам особого стиля:

source: You can add some additional CSS rules for better display:
ru_ru: Вы можете добавить дополнительные CSS правила для лучшего отображения блоков кода:

source: Save
ru_ru: Сохранить

source: Author
ru_ru: Автор

source: Igor Kalnitsky
ru_ru: Игорь Кальницкий

source: Plugin Info
ru_ru: О плагине

source: This is simple wordpress plugin for <a href="http://softwaremaniacs.org/soft/highlight/en/">highlight.js</a> library. <a href="http://softwaremaniacs.org/soft/highlight/en/">Highlight.js</a> highlights syntax in code examples on blogs, forums and in fact on any web pages. It&acute;s very easy to use because it works automatically: finds blocks of code, detects a language, highlights it.
ru_ru: Это простой Wordpress плагин для использования библиотеки <a href="http://softwaremaniacs.org/soft/highlight/">highlight.js</a>. <a href="http://softwaremaniacs.org/soft/highlight//">Highlight.js</a> нужен для подсветки синтаксиса в примерах кода в блогах, форумах и вообще на любых веб-страницах. Пользоваться им очень просто, потому что работает он автоматически: сам находит блоки кода, сам определяет язык, сам подсвечивает.

source: Plugin Usage
ru_ru: Использование

source: <p>For code highlighting you should use one of the following ways.</p> <p><strong>The first way</strong> is to use bb-codes:</p> <p><pre><code>[code] this language will be automatically determined [/code]</code></pre></p> <p><pre><code>[code lang="cpp"] highlight the code with certain language [/code]</code></pre></p> <p><strong>The second way</strong> is to use html-tags:</p> <p><pre><code class="html">&lt;pre&gt;&lt;code&gt; this language will be automatically determined &lt;/code&gt;&lt;/pre&gt;</code></pre></p> <p><pre><code class="html">&lt;pre&gt;&lt;code class="html"&gt; highlight the code with certain language &lt;/code&gt;&lt;/pre&gt;</code></pre></p>
ru_ru: <p>Для подсветки кода вы должны использовать один из приведённых ниже способов.</p> <p><strong>Первый способ</strong> заключается в использовании bb-кодов:</p> <p><pre><code>[code] этот язык будет автоматически определён [/code]</code></pre></p> <p><pre><code>[code lang="cpp"] подсветить код определённым языком [/code]</code></pre></p> <p><strong>Второй способ</strong> заключается в использовании html-тегов:</p> <p><pre><code class="html">&lt;pre&gt;&lt;code&gt; этот язык будет автоматически определён &lt;/code&gt;&lt;/pre&gt;</code></pre></p> <p><pre><code class="html">&lt;pre&gt;&lt;code class="html"&gt; подсветить код определённым языком &lt;/code&gt;&lt;/pre&gt;</code></pre></p>

source: Language Support
ru_ru: Поддерживаемые языки
